Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties
The serialization structure for AnalysisModelJobProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._JobName
The name of the job.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._Client
The name of the client.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._JobNumber
JThe number of the job.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._PartNumber
The part of the job.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._ReferenceNumber
The reference of the job.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._JobComment
The comment of the job.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._EngineerName
The name of engineer.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._EngineerDate
The date of the engineering.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._CheckerName
The name of the checker.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._CheckerDate
The date of the checking.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._ApprovedName
The name of approver.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._ApprovedDate
The date of the approval.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties._DateDelimiter
The date delimiter.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties.ToStruct(Tekla.Structures.Analysis.AnalysisModelJobProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties.FromStruct(Tekla.Structures.Analysis.AnalysisModelJobProperties)
DO NOT USE! For internal usage only!
P: P.